# 판다스 데이터프레임과 시리즈

---
## 1. 나만의 데이터 만들기

### 시리즈와 데이터프레임 만들기
#### 시리즈 만들기

In [2]:
import pandas as pd

# pd.Series(list)
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [3]:
# 시리즈 인덱스 지정하기
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], index=['Person', 'Who'])
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

#### 데이터프레임 만들기

In [6]:
# 딕셔너리를 DataFrame 클래스에 전달
scientists = pd.DataFrame({ 
    'Name': ['Rosaline Franklin', 'William Gosset'], 
    'Occupation': ['Chemist', 'Statistician'], 
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'Age': [37, 61]})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [13]:
# 데이터프레임 인덱스 지정하기
scientists = pd.DataFrame( 
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    # 열순서
    columns=['Occupation', 'Born', 'Age', 'Died'])
scientists

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

---
## 2. 시리즈 다루기 - 기초
==================================================
### 2.1 데이터프레임에서 시리즈 선택하기

In [16]:
# 데이터프레임 생성 
scientists = pd.DataFrame(
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Died', 'Age'])
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [18]:
first_row=scientists.loc['William Gosset']
first_row

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

==================================================
### 2.2 시리즈 속성과 메서드 사용하기 - index, values, keys

In [22]:
# index 속성
print(first_row.index)
print(first_row.index[0])

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')
Occupation

In [23]:
# key 메서드: index 속성과 동일
print(first_row.keys())
print(first_row.keys()[0])

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')
Occupation

In [20]:
# values 속성
first_row.values

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

==================================================
### 2.3 시리즈의 기초 통계 메서드 사용하기
#### 시리즈 메서드 정리
|시리즈 메서드|설명|
|--|--|
|append|2개 이상의 시리즈 연결|
|describe|요약 통계량 계산|
|drop_duplicates|중복값이 없는 시리즈 반환|
|equals|시리즈에 해당 값을 가진 요소가 있는지 확인|
|get_values|시리즈 값 구하기(values 속성과 동일)|
|isin|시리즈에 포함된 값이 있는지 확인|
|min|최소값 반환|
|max|최대값 반환|
|mean|산술 평균 반환|
|meadian|중위값 반환|
|replace|특정 값을 가진 시리즈 값을 교체|
|sample|시리즈에서 임의의 값을 반환|
|sort_values|값을 정렬|
|to_frame|시리즈를 데이터프레임으로 변환|

#### mean, min, max, std 메서드

In [29]:
ages = scientists['Age'] 
ages.max()

61

In [30]:
ages.min()

37

In [31]:
ages.mean()

49.0

In [32]:
ages.std()

16.97056274847714

---
## 3. 시리즈 다루기 - 응용
==================================================
### 3.1 시리즈와 불린 추출

In [36]:
scientists = pd.read_csv('../data/scientists.csv')
ages = scientists['Age']
print(ages.max())
print(ages.mean())

90
59.125

In [38]:
# 평균보다 나이가 많은 사람
print(ages > ages.mean())
print(ages[ages > ages.mean()])

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool
1    61
2    90
3    66
7    77
Name: Age, dtype: int64

==================================================
### 3.2 시리즈와 브로드캐스팅
#### 브로드캐스팅(Broadcasting)
시리즈나 데이터프레임에 있는 모든 데이터에 대해 한 번에 연산하는 것

In [39]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [40]:
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [41]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [42]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [43]:
# 길이가 서로 다른 벡터 연산: 같은 인덱스의 값만 계산(나머지는 NaN)
ages + pd.Series([1, 100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [44]:
# 시리즈 역순으로 정렬(인덱스를 기준으로)
rev_ages = ages.sort_index(ascending=False) 
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [45]:
# 인덱스가 일치하는 값끼리 연산: ages*2와 결과 동일
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

---
## 4. 데이터프레임 다루기
### 불린 추출과 브로드캐스팅

In [46]:
# Age의 값이 Age컬럼의 평균보다 높은 행만 출력
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [52]:
# 데이터프레임 연산(곱셈이면 연산, 문자열은 곱셈만가능해서 덧셈은 에러)
scientists*2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

---
## 5. 시리즈와 데이터프레임의 데이터 처리하기
### 시리즈와 데이터프레임의 데이터 처리하기
#### datetime 자료형

In [59]:
# datetime 자료형으로 변환
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(born_datetime,died_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns] 0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [56]:
# 새로운 열 추가하기
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [58]:
scientists['age_days_dt'] = (scientists['died_dt'] - scientists['born_dt'])
scientists['age_days_dt']

0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
Name: age_days_dt, dtype: timedelta64[ns]

#### 데이터 섞기

In [61]:
import random
random.seed(42)
random.shuffle(scientists['Age'])
scientists['Age']

c:\ProgramData\Anaconda3\lib\random.py:362: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

0    66
1    56
2    41
3    77
4    90
5    45
6    37
7    61
Name: Age, dtype: int64

#### 데이터프레임의 열 삭제하기

In [62]:
scientists_dropped = scientists.drop(['Age'], axis=1)
scientists_dropped

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

---
## 6. 데이터 저장하고 불러오기
### 데이터를 피클, CSV, TSV 파일로 저장하고 불러오기
#### 피클

In [64]:
# 저장
names = scientists['Name'] 
names.to_pickle('../output/scientists_names_series.pickle')
scientists.to_pickle('../output/scientists_df.pickle')

In [67]:
# 불러오기
scientist_names_from_pickle = pd.read_pickle('../output/scientists_names_series.pickle')
print(scientist_names_from_pickle)

scientists_from_pickle = pd.read_pickle('../output/scientists_df.pickle')
print(scientists_from_pickle)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object
                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   56        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   41               Nurse
3           Marie Curie  1867-11-07  1934-07-04   77             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   90           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   37  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   61       Mathematician

     born_dt    died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

#### CSV, TSV파일

In [68]:
names.to_csv('../output/scientist_names_series.csv')
scientists.to_csv('../output/scientists_df_no_index.csv', index=False)

# TSV파일: sep='\t'로 지정하고 확장자를 tsv로
scientists.to_csv('../output/scientists_df.tsv', sep='\t')

#### 엑셀파일

In [70]:
import openpyxl
names_df = names.to_frame()
names_df.to_excel('../output/scientists_names_series_df.xlsx')

In [ ]:
==================================================